Саракташ2/src/InformationRegisters/ПолитикаСписанияТоваров/ПолитикаСписанияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолитикаСписанияТоваров</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписанияТоваров</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:InformationRegister>

Саракташ2/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/Enums/МетодыСписанияТоваров/МетодыСписанияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыСписанияТоваров</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
    <comment>First input, first output (первым пришел, первым обработан)</comment>
  </enumValues>
  <enumValues>
    <name>ЛИФО</name>
    <comment>Last input, first output (последним пришел, первым обработан)</comment>
  </enumValues>
  <enumValues>
    <name>ПоУказаннойСтоимости</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаличия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьЭтикетку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварИзРеестраНХП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеЦеныЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОптРазрезыЗначения</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>EnumRef.ОптРазрезыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПохожиеРозничныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МастерицыДляПроверки</name>
    <attributes>
      <name>Мастерица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/CommonModules/УчетСебестоимости/Module.bsl
Процедура УчестьСебестоимость(Источник,РежимПроведения,Отказ) Экспорт
			
	ТипыРасход = Новый Соответствие;
	ТипыРасход.Вставить(Тип("ДокументОбъект.ЗаказПокупателя"),Истина);
	ТипыРасход.Вставить(Тип("ДокументОбъект.СписаниеТоваров"),Истина);
	ТипыРасход.Вставить(Тип("ДокументОбъект.ПеремещениеТоваров"),Истина);
	ТипыРасход.Вставить(Тип("ДокументОбъект.ВозвратТоваровПоставщику"),Истина);
	ТипыРасход.Вставить(Тип("ДокументОбъект.ИнвентаризацияТоваров"),Истина); 
	
	ТипыПриход = Новый Соответствие;
	ТипыПриход.Вставить(Тип("ДокументОбъект.ПоступлениеТоваров"),Истина);
	ТипыПриход.Вставить(Тип("ДокументОбъект.ПеремещениеТоваров"),Истина);
	ТипыПриход.Вставить(Тип("ДокументОбъект.ВозвратТоваровОтПокупателя"),Истина);	
	
	ТипИсточника = ТипЗнч(Источник);
	ДвиженияОчищеныПриСписании = Ложь;
	Если ТипыРасход[ТипИсточника] = Истина Тогда
		СписатьТовары(Источник,РежимПроведения,Отказ);
		ДвиженияОчищеныПриСписании = Истина;
	КонецЕсли;
	
	Если НЕ Отказ И ТипыПриход[ТипИсточника] = Истина Тогда
		ПринятьТовары(Источник,РежимПроведения,Отказ, ДвиженияОчищеныПриСписании);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПринятьТовары(Источник,РежимПроведения,Отказ, ДвиженияОчищеныПриСписании = Ложь) 
	
	Если НЕ ЯвляетсяРегистраторомСебестоимости(Источник) Тогда
		Отказ = Истина;
		Сообщить(""+Источник.Ссылка+" не является регистратором ""Себестоимость товаров""!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	МетодСписания = РегистрыСведений.ПолитикаСписанияТоваров.ПолучитьПоследнее(Источник.Дата).МетодСписания;
	Если НЕ ЗначениеЗаполнено(МетодСписания) Тогда
		Отказ = Истина;
		Сообщить(""+Источник.Ссылка+": Не указан метод списания товаров!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	ЗаполнятьПартию = (МетодСписания = Перечисления.МетодыСписанияТоваров.ЛИФО ИЛИ МетодСписания = Перечисления.МетодыСписанияТоваров.ФИФО);
	
	Движения = Источник.Движения.СебестоимостьТоваров;
	Движения.Записывать = Истина;  
	
	Если Не ДвиженияОчищеныПриСписании Тогда  		
		Движения.Очистить();
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьРеквизитСумма = (Источник.Метаданные().ТабличныеЧасти["Товары"].Реквизиты.Найти("Сумма")<>Неопределено);
	
	Для Каждого Стр Из Источник.Товары Цикл
		
		Если Стр.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") И Стр.Отклонение <=0 Тогда //Инвентаризация может списывать товар
			Продолжить;
		КонецЕсли;
		
		Движение =  Движения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Источник.Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Движение.Партия = ?(ЗаполнятьПартию,Источник.Ссылка,Неопределено);		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") Тогда
			Движение.Количество = Стр.Отклонение;
		Иначе
			Движение.Количество = Стр.Количество;
		КонецЕсли;
		Движение.Сумма = ?(ЕстьРеквизитСумма,Стр.Сумма,Стр.Цена);		
		//Движение.Сумма = 1000;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СписатьТовары(Источник,РежимПроведения,Отказ) 
	
	Если НЕ ЯвляетсяРегистраторомСебестоимости(Источник) Тогда
		Отказ = Истина;
		Сообщить(""+Источник.Ссылка+" не является регистратором ""Себестоимость товаров""!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	МетодСписания = РегистрыСведений.ПолитикаСписанияТоваров.ПолучитьПоследнее(Источник.Дата).МетодСписания;
	Если НЕ ЗначениеЗаполнено(МетодСписания) Тогда
		Отказ = Истина;
		Сообщить(""+Источник.Ссылка+": Не указан метод списания товаров!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	ЗаполнятьПартию = (МетодСписания = Перечисления.МетодыСписанияТоваров.ЛИФО ИЛИ МетодСписания = Перечисления.МетодыСписанияТоваров.ФИФО);
	
	Движения = Источник.Движения.СебестоимостьТоваров;
	Движения.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СебестоимостьТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Источник.Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		Движения.Очистить();
		Движения.БлокироватьДляИзменения = Истина;
	    Движения.Записать();
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	Если МетодСписания = Перечисления.МетодыСписанияТоваров.ПоУказаннойСтоимости Тогда
		СписатьТоварыПоУказаннойСтоимости(Источник,РежимПроведения,Отказ,Движения);
		Возврат;
	ИначеЕсли МетодСписания = Перечисления.МетодыСписанияТоваров.ПоСредней Тогда
		СписатьТоварыПоСредней(Источник,РежимПроведения,Отказ,Движения);
	    Возврат;
	КонецЕсли;
	
	// списание по FIFO/LIFO		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тчТовары.Номенклатура,
	|	тчТовары.Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тчТовары КАК тчТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	СУММА(втТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыФильтр
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	ВЫРАЗИТЬ(втТовары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстатки.Номенклатура,
	|	СебестоимостьТоваровОстатки.Партия,
	|	СебестоимостьТоваровОстатки.КоличествоОстаток,
	|	СебестоимостьТоваровОстатки.СуммаОстаток
	|ПОМЕСТИТЬ ОстаткиПартий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыФильтр.Номенклатура
	|				ИЗ
	|					ТоварыФильтр)) КАК СебестоимостьТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Количество КАК КоличествоСписать,
	|	ЕСТЬNULL(ОстаткиПартий.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	|	ЕСТЬNULL(ОстаткиПартий.КоличествоОстаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ОстаткиПартий.СуммаОстаток, 0) КАК СтоимостьОстатка
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПартий КАК ОстаткиПартий
	|		ПО втТовары.Номенклатура = ОстаткиПартий.Номенклатура
	|ГДЕ
	|	ОстаткиПартий.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиПартий.Партия.МоментВремени
	|ИТОГИ
	|	МИНИМУМ(КоличествоСписать),
	|	СУММА(Остаток),
	|	СУММА(СтоимостьОстатка)
	|ПО
	|	Номенклатура"; 	   		
	
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") Тогда //Инвентаризация может не только списывать товар
		
		ЗапросИнв = Новый Запрос;
		ЗапросИнв.Текст = 
		"ВЫБРАТЬ
		|	тчТовары.Номенклатура КАК Номенклатура,
		|	тчТовары.Количество КАК Количество
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&тчТовары КАК тчТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Количество КАК Количество
		|ИЗ
		|	втТовары КАК втТовары
		|ГДЕ
		|	втТовары.Количество <> 0";
		
		ЗапросИнв.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Количество"));
		
		Запрос.УстановитьПараметр("тчТовары", ЗапросИнв.Выполнить().Выгрузить());
		
	Иначе
		Запрос.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Количество"));
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("МоментВремени",Источник.МоментВремени());  
	
	Если МетодСписания = Перечисления.МетодыСписанияТоваров.ЛИФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УПОРЯДОЧИТЬ ПО
		|	ОстаткиПартий.Партия.МоментВремени", "УПОРЯДОЧИТЬ ПО
		|	ОстаткиПартий.Партия.МоментВремени УБЫВ"); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
    Пока Выборка.Следующий() Цикл

		ОсталосьСписать = МИН(Выборка.КоличествоСписать, Выборка.Остаток);       		
		ВыборкаПартии = Выборка.Выбрать();
		Пока ВыборкаПартии.Следующий() И ОсталосьСписать > 0 Цикл
			
			Списать = МИН(ОсталосьСписать, ВыборкаПартии.Остаток);
			Себестоимость = Списать / ВыборкаПартии.Остаток * ВыборкаПартии.СтоимостьОстатка;      			
			Движение = Движения.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Источник. Дата;
			Движение.Номенклатура = ВыборкаПартии.Номенклатура;
			Движение.Партия = ВыборкаПартии.Партия;
			Движение.Количество = Списать;
			Движение.Сумма = Себестоимость;   			
			ОсталосьСписать = ОсталосьСписать - Списать;  
			
		КонецЦикла;
    КонецЦикла;  
	
КонецПроцедуры

Процедура СписатьТоварыПоУказаннойСтоимости(Источник,РежимПроведения,Отказ,Движения) 
	
	ЕстьРеквизитЦенаЗакупки = Источник.Метаданные.ТабличныеЧасти.Реквизиты.Найти("ЦенаЗакупки")<>Неопределено; 
	Для Каждого Стр Из Источник.Товары Цикл
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") И Стр.Отклонение >=0 Тогда //Инвентаризация может списывать товар
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник. Дата;
		Движение.Номенклатура = Стр.Номенклатура;
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") Тогда
			Движение.Количество = Стр.Отклонение;
		Иначе
			Движение.Количество = Стр.Количество;
		КонецЕсли;
		Движение.Сумма = Стр.Количество*?(ЕстьРеквизитЦенаЗакупки,Стр.ЦенаЗакупки,Стр.Цена);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура _СписатьТоварыПоСредней(Источник,РежимПроведения,Отказ,Движения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тчТовары.Номенклатура,
	|	тчТовары.Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тчТовары КАК тчТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура,
	|	СУММА(втТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыФильтр
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	ВЫРАЗИТЬ(втТовары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстатки.Номенклатура,
	|	СебестоимостьТоваровОстатки.КоличествоОстаток,
	|	СебестоимостьТоваровОстатки.СуммаОстаток
	|ПОМЕСТИТЬ ОстаткиПартий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыФильтр.Номенклатура
	|				ИЗ
	|					ТоварыФильтр)) КАК СебестоимостьТоваровОстатки
	|ГДЕ
	|	СебестоимостьТоваровОстатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Количество КАК Количество,
	|	втТовары.Количество * ВЫБОР
	|		КОГДА ОстаткиПартий.КоличествоОстаток = 0
	|			ТОГДА ОстаткиПартий.СуммаОстаток
	|		ИНАЧЕ ОстаткиПартий.СуммаОстаток / ОстаткиПартий.КоличествоОстаток
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	втТовары КАК втТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиПартий КАК ОстаткиПартий
	|		ПО втТовары.Номенклатура = ОстаткиПартий.Номенклатура";		
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") Тогда //Инвентаризация может не только списывать товар
		
		ЗапросИнв = Новый Запрос;
		ЗапросИнв.Текст = 
		"ВЫБРАТЬ
		|	тчТовары.Номенклатура КАК Номенклатура,
		|	тчТовары.Отклонение КАК Количество
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&тчТовары КАК тчТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Количество * -1 КАК Количество
		|ИЗ
		|	втТовары КАК втТовары
		|ГДЕ
		|	втТовары.Количество <> 0";
		
		ЗапросИнв.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Отклонение"));
		
		Запрос.УстановитьПараметр("тчТовары", ЗапросИнв.Выполнить().Выгрузить());
		
	Иначе
		Запрос.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Количество"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МоментВремени",Источник.МоментВремени());
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник. Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ЯвляетсяРегистраторомСебестоимости(Источник)
	
	Возврат Метаданные.РегистрыНакопления.СебестоимостьТоваров.СтандартныеРеквизиты.Регистратор.Тип.СодержитТип(ТипЗнч(Источник.Ссылка));
	
КонецФункции

Процедура ПерепровестиДокументыОтДаты(Дата, ТолькоСебестоимость = Ложь) Экспорт
	
	ТекстЗапроса = ""; 	
	ТипыДокументов = Метаданные.РегистрыНакопления.СебестоимостьТоваров.СтандартныеРеквизиты.Регистратор.Тип.Типы();
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		ДокументСсылка = Новый(ТипДокумента);
    	ТекТекст = ?(ПустаяСтрока(ТекстЗапроса),"","
		|ОБЪЕДИНИТЬ ВСЕ
		|")+"
		|ВЫБРАТЬ
		|	Доки.Ссылка,
		|	Доки.МоментВремени
		|"+?(ПустаяСтрока(ТекстЗапроса),"ПОМЕСТИТЬ вт
		|","")+"ИЗ
		|	Документ."+ДокументСсылка.Метаданные().Имя+" КАК Доки
		|ГДЕ
		|	Доки.Проведен
		|	И Доки.Дата >= &Дата";
		ТекстЗапроса = ТекстЗапроса + ТекТекст;
	КонецЦикла;
	
	ТекстЗапроса = СокрЛП(ТекстЗапроса)+"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Ссылка,
	|	вт.МоментВремени КАК МоментВремени
	|ИЗ
	|	вт КАК вт
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Дата",Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		Источник = Выборка.Ссылка.ПолучитьОбъект();
		Если Не ТолькоСебестоимость Тогда
			Источник.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НачатьТранзакцию();
			Отказ = Ложь;
			УчестьСебестоимость(Источник, РежимПроведенияДокумента.Неоперативный, Отказ);
			Если ТранзакцияАктивна() Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		КонецЕсли; 		
	КонецЦикла; 
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработано документов: "+Всего;
	Сообщение.Сообщить();
		
КонецПроцедуры

Процедура СписатьТоварыПоСредней(Источник,РежимПроведения,Отказ,Движения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тчТовары.Номенклатура КАК Номенклатура,
	|	тчТовары.Количество КАК Количество
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&тчТовары КАК тчТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	СУММА(втТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ТоварыФильтр
	|ИЗ
	|	втТовары КАК втТовары
	|ГДЕ
	|	ВЫРАЗИТЬ(втТовары.Номенклатура КАК Справочник.Номенклатура).ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстатки.Номенклатура КАК Номенклатура,
	|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	СебестоимостьТоваровОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ОстаткиПартий
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыФильтр.Номенклатура
	|				ИЗ
	|					ТоварыФильтр)) КАК СебестоимостьТоваровОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.Номенклатура КАК Номенклатура,
	|	втТовары.Количество КАК Количество,
	|	ЕСТЬNULL(ОстаткиПартий.КоличествоОстаток, 0) КАК Остаток,
	|	втТовары.Количество * ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА ЕСТЬNULL(ОстаткиПартий.СуммаОстаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ОстаткиПартий.СуммаОстаток, 0) / ОстаткиПартий.КоличествоОстаток
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПартий КАК ОстаткиПартий
	|		ПО втТовары.Номенклатура = ОстаткиПартий.Номенклатура";		
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ИнвентаризацияТоваров") Тогда //Инвентаризация может не только списывать товар
		
		ЗапросИнв = Новый Запрос;
		ЗапросИнв.Текст = 
		"ВЫБРАТЬ
		|	тчТовары.Номенклатура КАК Номенклатура,
		|	тчТовары.Отклонение КАК Количество
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&тчТовары КАК тчТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Количество * -1 КАК Количество
		|ИЗ
		|	втТовары КАК втТовары
		|ГДЕ
		|	втТовары.Количество <> 0";
		
		ЗапросИнв.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Отклонение"));
		
		Запрос.УстановитьПараметр("тчТовары", ЗапросИнв.Выполнить().Выгрузить());
		
	Иначе
		Запрос.УстановитьПараметр("тчТовары",Источник.Товары.Выгрузить(,"Номенклатура,Количество"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МоментВремени",Источник.МоментВремени());
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество > Выборка.Остаток Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "ВНИМАНИЕ! СЕБЕСТОИМОСТЬ! "+Выборка.Номенклатура+" / "+Источник.Ссылка+Символы.ПС+"К списанию: "+Выборка.Количество+"; На остатке: "+Выборка.Остаток+";";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник. Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;
		
	КонецЦикла;	
	
КонецПроцедуры
